* Ergodox
** Set config
#+begin_src bash
qmk config user.keyboard=ergodox_ez
qmk config user.keymap=RobertPlant	
#+end_src

#+RESULTS:
| user.keyboard: | None | -> | ergodox_ez  |
| user.keymap:   | None | -> | RobertPlant |

** Setup QMK
#+begin_src bash
yay qmk
cd
git clone git@github.com:qmk/qmk_firmware.git
qmk setup
mkdir -p ~/qmk_firmware/keyboards/ergodox_ez/keymaps/RobertPlant
#+end_src

** Setup Wally CLI
#+begin_src bash
yay wally-cli
#+end_src

** Copy configuration
#+begin_src bash :results none
cd ~/projects/keyboard_layouts/ergodox
cp * ~/qmk_firmware/keyboards/ergodox_ez/keymaps/RobertPlant/
#+end_src

** Compile
#+begin_src bash :results output
qmk compile
#+end_src

#+RESULTS:
#+begin_example


QMK Firmware 0.11.68
Making [1mergodox_ez[0m with keymap [1mRobertPlant[0m

avr-gcc (GCC) 11.1.0
Copyright (C) 2021 Free Software Foundation, Inc.
This is free software; see the source for copying conditions.  There is NO
warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.

Size before:
   text	   data	    bss	    dec	    hex	filename
      0	  21810	      0	  21810	   5532	.build/ergodox_ez_RobertPlant.hex

Compiling: keyboards/ergodox_ez/matrix.c                                                            [32;01m[OK][0m
Compiling: keyboards/ergodox_ez/led_i2c.c                                                           [32;01m[OK][0m
Compiling: keyboards/ergodox_ez/ergodox_ez.c                                                        [32;01m[OK][0m
Compiling: keyboards/ergodox_ez/keymaps/RobertPlant/keymap.c                                        [32;01m[OK][0m
Compiling: quantum/quantum.c                                                                        [32;01m[OK][0m
Compiling: quantum/bitwise.c                                                                        [32;01m[OK][0m
Compiling: quantum/led.c                                                                            [32;01m[OK][0m
Compiling: quantum/keymap_common.c                                                                  [32;01m[OK][0m
Compiling: quantum/keycode_config.c                                                                 [32;01m[OK][0m
Compiling: quantum/matrix_common.c                                                                  [32;01m[OK][0m
Compiling: quantum/debounce/sym_eager_pr.c                                                          [32;01m[OK][0m
Compiling: quantum/wpm.c                                                                            [32;01m[OK][0m
Compiling: quantum/process_keycode/process_unicode.c                                                [32;01m[OK][0m
Compiling: quantum/process_keycode/process_unicode_common.c                                         [32;01m[OK][0m
Compiling: quantum/process_keycode/process_space_cadet.c                                            [32;01m[OK][0m
Compiling: quantum/process_keycode/process_magic.c                                                  [32;01m[OK][0m
Compiling: quantum/process_keycode/process_grave_esc.c                                              [32;01m[OK][0m
Compiling: drivers/avr/i2c_master.c                                                                 [32;01m[OK][0m
Archiving: .build/obj_ergodox_ez_RobertPlant/i2c_master.o                                           [32;01m[OK][0m
Compiling: tmk_core/common/host.c                                                                   [32;01m[OK][0m
Compiling: tmk_core/common/keyboard.c                                                               [32;01m[OK][0m
Compiling: tmk_core/common/action.c                                                                 [32;01m[OK][0m
Compiling: tmk_core/common/action_tapping.c                                                         [32;01m[OK][0m
Compiling: tmk_core/common/action_macro.c                                                           [32;01m[OK][0m
Compiling: tmk_core/common/action_layer.c                                                           [32;01m[OK][0m
Compiling: tmk_core/common/action_util.c                                                            [32;01m[OK][0m
Compiling: tmk_core/common/print.c                                                                  [32;01m[OK][0m
Compiling: tmk_core/common/debug.c                                                                  [32;01m[OK][0m
Compiling: tmk_core/common/sendchar_null.c                                                          [32;01m[OK][0m
Compiling: tmk_core/common/eeconfig.c                                                               [32;01m[OK][0m
Compiling: tmk_core/common/report.c                                                                 [32;01m[OK][0m
Compiling: tmk_core/common/avr/suspend.c                                                            [32;01m[OK][0m
Compiling: tmk_core/common/avr/timer.c                                                              [32;01m[OK][0m
Compiling: tmk_core/common/avr/bootloader.c                                                         [32;01m[OK][0m
Assembling: tmk_core/common/avr/xprintf.S                                                           [32;01m[OK][0m
Compiling: tmk_core/common/magic.c                                                                  [32;01m[OK][0m
Compiling: tmk_core/common/mousekey.c                                                               [32;01m[OK][0m
Compiling: tmk_core/protocol/lufa/lufa.c                                                            [32;01m[OK][0m
Compiling: tmk_core/protocol/usb_descriptor.c                                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Class/Common/HIDParser.c                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Device_AVR8.c                                        [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/EndpointStream_AVR8.c                                [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Endpoint_AVR8.c                                      [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Host_AVR8.c                                          [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/PipeStream_AVR8.c                                    [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/Pipe_AVR8.c                                          [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/USBController_AVR8.c                                 [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/AVR8/USBInterrupt_AVR8.c                                  [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/ConfigDescriptors.c                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/DeviceStandardReq.c                                       [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/Events.c                                                  [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/HostStandardReq.c                                         [32;01m[OK][0m
Compiling: lib/lufa/LUFA/Drivers/USB/Core/USBTask.c                                                 [32;01m[OK][0m
Linking: .build/ergodox_ez_RobertPlant.elf                                                          [33;01m[WARNINGS][0m
 |
 | lto-wrapper: warning: Options to '-Xassembler' do not match: -adhlns=.build/obj_ergodox_ez_RobertPlant/matrix.lst, -adhlns=.build/obj_ergodox_ez_RobertPlant/led_i2c.lst, dropping all '-Xassembler' and '-Wa' options.
 |
Creating load file for flashing: .build/ergodox_ez_RobertPlant.hex                                  [32;01m[OK][0m
Copying ergodox_ez_RobertPlant.hex to qmk_firmware folder                                           [32;01m[OK][0m
Checking file size of ergodox_ez_RobertPlant.hex                                                    [32;01m[OK][0m
 ,* The firmware size is fine - 21766/32256 (67%, 10490 bytes free)
#+end_example

** Copy built hex file
#+begin_src bash
cd ~/projects/keyboard_layouts/ergodox
cp ~/qmk_firmware/.build/ergodox_ez_RobertPlant.hex .
#+end_src

#+RESULTS:
** Copy file to the keyboard
#+begin_src bash :results none
cd ~/projects/keyboard_layouts/ergodox; wally-cli ergodox_ez_RobertPlant.hex
#+end_src

Note Emacs cant handle returning the output of wally-cli, so its hidden. It asks
you to press flash mode on the Teensy.

* IBM Model M (Teensy)

#+begin_src bash
./scas ibm.sc ibm.scb
./scwr ibm.scb
#+end_src

#+RESULTS:
